---
type: DimensionType
namespace: Autodesk.Revit.DB
version: 2024
members: 18
tags: [revit-api, class]
---

# DimensionType

`Autodesk.Revit.DB.DimensionType` · Revit 2024 · 18 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CanHaveEqualityFormula | — | `public bool CanHaveEqualityFormula ()` |
| Method | CanHaveOrdinateDimensionSetting | — | `public bool CanHaveOrdinateDimensionSetting ()` |
| Method | GetAlternateUnitsFormatOptions | — | `public FormatOptions GetAlternateUnitsFormatOptions ()` |
| Method | GetEqualityFormula | 2017 Subscription Update | `public IList < DimensionEqualityLabelFormatting > GetEqualityFormula ()` |
| Method | GetOrdinateDimensionSetting | 2017 Subscription Update | `public OrdinateDimensionSetting GetOrdinateDimensionSetting ()` |
| Method | GetSpecTypeId | — | `public ForgeTypeId GetSpecTypeId ()` |
| Method | GetUnitsFormatOptions | 2017 Subscription Update | `public FormatOptions GetUnitsFormatOptions ()` |
| Method | SetAlternateUnitsFormatOptions | — | `public void SetAlternateUnitsFormatOptions ( FormatOptions formatOptions )` |
| Method | SetEqualityFormula | 2017 Subscription Update | `public void SetEqualityFormula ( IList < DimensionEqualityLabelFormatting > formattingArr )` |
| Method | SetOrdinateDimensionSetting | 2017 Subscription Update | `public void SetOrdinateDimensionSetting ( OrdinateDimensionSetting ordinateDimSetting )` |
| Method | SetUnitsFormatOptions | 2017 Subscription Update | `public void SetUnitsFormatOptions ( FormatOptions formatOptions )` |
| Property | AlternateUnits | — | `public AlternateUnits AlternateUnits { get ; set ; }` |
| Property | AlternateUnitsPrefix | — | `public string AlternateUnitsPrefix { get ; set ; }` |
| Property | AlternateUnitsSuffix | — | `public string AlternateUnitsSuffix { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Prefix | 2022 | `public string Prefix { get ; set ; }` |
| Property | StyleType | — | `public DimensionStyleType StyleType { get ; }` |
| Property | Suffix | 2022 | `public string Suffix { get ; set ; }` |